; ModuleID = 'generated_code.bc'
source_filename = "generated_code.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [2 x i8] c"a\00", align 1
@.str.1 = private unnamed_addr constant [27 x i8] c"Error opening output file\0A\00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c"char\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@.str.4 = private unnamed_addr constant [6 x i8] c"float\00", align 1
@.str.5 = private unnamed_addr constant [7 x i8] c"double\00", align 1
@.str.6 = private unnamed_addr constant [4 x i8] c"%f\0A\00", align 1
@.str.7 = private unnamed_addr constant [5 x i8] c"long\00", align 1
@.str.8 = private unnamed_addr constant [6 x i8] c"%lld\0A\00", align 1
@.str.9 = private unnamed_addr constant [4 x i8] c"%d\0A\00", align 1
@.str.10 = private unnamed_addr constant [2 x i8] c"x\00", align 1
@.str.11 = private unnamed_addr constant [4 x i8] c"int\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "generated_code.c", directory: "/home/suyoung02/klee/KLEE_Simple", checksumkind: CSK_MD5, checksum: "6f1cde6bdef58b2b3c3ff51f329a2d8d")
!2 = !{!3, !4, !6, !8, !10}
!3 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !{i32 7, !"Dwarf Version", i32 5}
!13 = !{i32 2, !"Debug Info Version", i32 3}
!14 = !{i32 1, !"wchar_size", i32 4}
!15 = !{i32 7, !"PIC Level", i32 2}
!16 = !{i32 7, !"PIE Level", i32 2}
!17 = !{i32 7, !"uwtable", i32 1}
!18 = !{i32 7, !"frame-pointer", i32 2}
!19 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!20 = distinct !DISubprogram(name: "get_sign", scope: !21, file: !21, line: 1, type: !22, scopeLine: 1, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!21 = !DIFile(filename: "././sample-code/get_sign.c", directory: "/home/suyoung02/klee/KLEE_Simple", checksumkind: CSK_MD5, checksum: "5451c5d0adcb46322bfc036b841a5b14")
!22 = !DISubroutineType(types: !23)
!23 = !{!11, !11}
!24 = !{}
!25 = !DILocalVariable(name: "x", arg: 1, scope: !20, file: !21, line: 1, type: !11)
!26 = !DILocation(line: 1, column: 18, scope: !20)
!27 = !DILocation(line: 2, column: 7, scope: !28)
!28 = distinct !DILexicalBlock(scope: !20, file: !21, line: 2, column: 7)
!29 = !DILocation(line: 2, column: 9, scope: !28)
!30 = !DILocation(line: 2, column: 7, scope: !20)
!31 = !DILocation(line: 3, column: 5, scope: !28)
!32 = !DILocation(line: 5, column: 7, scope: !33)
!33 = distinct !DILexicalBlock(scope: !20, file: !21, line: 5, column: 7)
!34 = !DILocation(line: 5, column: 9, scope: !33)
!35 = !DILocation(line: 5, column: 7, scope: !20)
!36 = !DILocation(line: 6, column: 5, scope: !33)
!37 = !DILocation(line: 8, column: 5, scope: !33)
!38 = !DILocation(line: 9, column: 1, scope: !20)
!39 = distinct !DISubprogram(name: "saveFile", scope: !40, file: !40, line: 1, type: !41, scopeLine: 1, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!40 = !DIFile(filename: "././WriteArrayTtoFile.c", directory: "/home/suyoung02/klee/KLEE_Simple", checksumkind: CSK_MD5, checksum: "855c61aa3aba440a0abd8aa9600d77bc")
!41 = !DISubroutineType(types: !42)
!42 = !{null, !3, !4, !4}
!43 = !DILocalVariable(name: "data", arg: 1, scope: !39, file: !40, line: 1, type: !3)
!44 = !DILocation(line: 1, column: 21, scope: !39)
!45 = !DILocalVariable(name: "dataType", arg: 2, scope: !39, file: !40, line: 1, type: !4)
!46 = !DILocation(line: 1, column: 32, scope: !39)
!47 = !DILocalVariable(name: "filename", arg: 3, scope: !39, file: !40, line: 1, type: !4)
!48 = !DILocation(line: 1, column: 49, scope: !39)
!49 = !DILocalVariable(name: "output_file", scope: !39, file: !40, line: 2, type: !50)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !52, line: 7, baseType: !53)
!52 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !54, line: 49, size: 1728, elements: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !71, !73, !74, !75, !79, !81, !83, !87, !90, !92, !95, !98, !99, !100, !104, !105}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !53, file: !54, line: 51, baseType: !11, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !53, file: !54, line: 54, baseType: !4, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !53, file: !54, line: 55, baseType: !4, size: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !53, file: !54, line: 56, baseType: !4, size: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !53, file: !54, line: 57, baseType: !4, size: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !53, file: !54, line: 58, baseType: !4, size: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !53, file: !54, line: 59, baseType: !4, size: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !53, file: !54, line: 60, baseType: !4, size: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !53, file: !54, line: 61, baseType: !4, size: 64, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !53, file: !54, line: 64, baseType: !4, size: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !53, file: !54, line: 65, baseType: !4, size: 64, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !53, file: !54, line: 66, baseType: !4, size: 64, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !53, file: !54, line: 68, baseType: !69, size: 64, offset: 768)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !54, line: 36, flags: DIFlagFwdDecl)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !53, file: !54, line: 70, baseType: !72, size: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !53, file: !54, line: 72, baseType: !11, size: 32, offset: 896)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !53, file: !54, line: 73, baseType: !11, size: 32, offset: 928)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !53, file: !54, line: 74, baseType: !76, size: 64, offset: 960)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !77, line: 152, baseType: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!78 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !53, file: !54, line: 77, baseType: !80, size: 16, offset: 1024)
!80 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !53, file: !54, line: 78, baseType: !82, size: 8, offset: 1040)
!82 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !53, file: !54, line: 79, baseType: !84, size: 8, offset: 1048)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 1)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !53, file: !54, line: 81, baseType: !88, size: 64, offset: 1088)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !54, line: 43, baseType: null)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !53, file: !54, line: 89, baseType: !91, size: 64, offset: 1152)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !77, line: 153, baseType: !78)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !53, file: !54, line: 91, baseType: !93, size: 64, offset: 1216)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !54, line: 37, flags: DIFlagFwdDecl)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !53, file: !54, line: 92, baseType: !96, size: 64, offset: 1280)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !54, line: 38, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !53, file: !54, line: 93, baseType: !72, size: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !53, file: !54, line: 94, baseType: !3, size: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !53, file: !54, line: 95, baseType: !101, size: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 46, baseType: !103)
!102 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!103 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !53, file: !54, line: 96, baseType: !11, size: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !53, file: !54, line: 98, baseType: !106, size: 160, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 160, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DILocation(line: 2, column: 11, scope: !39)
!110 = !DILocation(line: 2, column: 31, scope: !39)
!111 = !DILocation(line: 2, column: 25, scope: !39)
!112 = !DILocation(line: 5, column: 10, scope: !113)
!113 = distinct !DILexicalBlock(scope: !39, file: !40, line: 5, column: 9)
!114 = !DILocation(line: 5, column: 9, scope: !39)
!115 = !DILocation(line: 6, column: 9, scope: !116)
!116 = distinct !DILexicalBlock(scope: !113, file: !40, line: 5, column: 23)
!117 = !DILocation(line: 7, column: 9, scope: !116)
!118 = !DILocation(line: 9, column: 16, scope: !119)
!119 = distinct !DILexicalBlock(scope: !39, file: !40, line: 9, column: 9)
!120 = !DILocation(line: 9, column: 9, scope: !119)
!121 = !DILocation(line: 9, column: 34, scope: !119)
!122 = !DILocation(line: 9, column: 9, scope: !39)
!123 = !DILocation(line: 10, column: 17, scope: !124)
!124 = distinct !DILexicalBlock(scope: !119, file: !40, line: 9, column: 43)
!125 = !DILocation(line: 10, column: 45, scope: !124)
!126 = !DILocation(line: 10, column: 9, scope: !124)
!127 = !DILocation(line: 11, column: 5, scope: !124)
!128 = !DILocation(line: 11, column: 24, scope: !129)
!129 = distinct !DILexicalBlock(scope: !119, file: !40, line: 11, column: 16)
!130 = !DILocation(line: 11, column: 17, scope: !129)
!131 = !DILocation(line: 11, column: 43, scope: !129)
!132 = !DILocation(line: 11, column: 52, scope: !129)
!133 = !DILocation(line: 11, column: 64, scope: !129)
!134 = !DILocation(line: 11, column: 57, scope: !129)
!135 = !DILocation(line: 11, column: 84, scope: !129)
!136 = !DILocation(line: 11, column: 16, scope: !119)
!137 = !DILocation(line: 12, column: 17, scope: !138)
!138 = distinct !DILexicalBlock(scope: !129, file: !40, line: 11, column: 94)
!139 = !DILocation(line: 12, column: 48, scope: !138)
!140 = !DILocation(line: 12, column: 39, scope: !138)
!141 = !DILocation(line: 12, column: 38, scope: !138)
!142 = !DILocation(line: 12, column: 9, scope: !138)
!143 = !DILocation(line: 13, column: 5, scope: !138)
!144 = !DILocation(line: 13, column: 22, scope: !145)
!145 = distinct !DILexicalBlock(scope: !129, file: !40, line: 13, column: 15)
!146 = !DILocation(line: 13, column: 15, scope: !145)
!147 = !DILocation(line: 13, column: 40, scope: !145)
!148 = !DILocation(line: 13, column: 15, scope: !129)
!149 = !DILocation(line: 14, column: 17, scope: !150)
!150 = distinct !DILexicalBlock(scope: !145, file: !40, line: 13, column: 49)
!151 = !DILocation(line: 14, column: 53, scope: !150)
!152 = !DILocation(line: 14, column: 41, scope: !150)
!153 = !DILocation(line: 14, column: 40, scope: !150)
!154 = !DILocation(line: 14, column: 9, scope: !150)
!155 = !DILocation(line: 15, column: 5, scope: !150)
!156 = !DILocation(line: 16, column: 17, scope: !157)
!157 = distinct !DILexicalBlock(scope: !145, file: !40, line: 15, column: 12)
!158 = !DILocation(line: 16, column: 45, scope: !157)
!159 = !DILocation(line: 16, column: 39, scope: !157)
!160 = !DILocation(line: 16, column: 38, scope: !157)
!161 = !DILocation(line: 16, column: 9, scope: !157)
!162 = !DILocation(line: 20, column: 12, scope: !39)
!163 = !DILocation(line: 20, column: 5, scope: !39)
!164 = !DILocation(line: 21, column: 1, scope: !39)
!165 = distinct !DISubprogram(name: "saveArrayFile", scope: !40, file: !40, line: 23, type: !41, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!166 = !DILocalVariable(name: "data", arg: 1, scope: !165, file: !40, line: 23, type: !3)
!167 = !DILocation(line: 23, column: 26, scope: !165)
!168 = !DILocalVariable(name: "dataType", arg: 2, scope: !165, file: !40, line: 23, type: !4)
!169 = !DILocation(line: 23, column: 37, scope: !165)
