; ModuleID = 'generated_code.bc'
source_filename = "generated_code.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [19 x i8] c"get_sign.input.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"a\00", align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.3 = private unnamed_addr constant [27 x i8] c"Error opening output file\0A\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"char\00", align 1
@.str.5 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@.str.6 = private unnamed_addr constant [6 x i8] c"float\00", align 1
@.str.7 = private unnamed_addr constant [7 x i8] c"double\00", align 1
@.str.8 = private unnamed_addr constant [4 x i8] c"%f\0A\00", align 1
@.str.9 = private unnamed_addr constant [5 x i8] c"long\00", align 1
@.str.10 = private unnamed_addr constant [6 x i8] c"%lld\0A\00", align 1
@.str.11 = private unnamed_addr constant [4 x i8] c"%d\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "generated_code.c", directory: "/home/suyoung02/klee/KLEE_Simple", checksumkind: CSK_MD5, checksum: "127ade65bc92bfe639129cdc6643d5b0")
!2 = !{!3, !4, !6, !8, !10}
!3 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !{i32 7, !"Dwarf Version", i32 5}
!13 = !{i32 2, !"Debug Info Version", i32 3}
!14 = !{i32 1, !"wchar_size", i32 4}
!15 = !{i32 7, !"PIC Level", i32 2}
!16 = !{i32 7, !"PIE Level", i32 2}
!17 = !{i32 7, !"uwtable", i32 1}
!18 = !{i32 7, !"frame-pointer", i32 2}
!19 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!20 = distinct !DISubprogram(name: "get_sign", scope: !21, file: !21, line: 1, type: !22, scopeLine: 1, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!21 = !DIFile(filename: "././sample-code/get_sign.c", directory: "/home/suyoung02/klee/KLEE_Simple", checksumkind: CSK_MD5, checksum: "799043a50e034bde7d5ef59e460dab5c")
!22 = !DISubroutineType(types: !23)
!23 = !{!11, !11}
!24 = !{}
!25 = !DILocalVariable(name: "x", arg: 1, scope: !20, file: !21, line: 1, type: !11)
!26 = !DILocation(line: 1, column: 18, scope: !20)
!27 = !DILocalVariable(name: "output_file", scope: !20, file: !21, line: 2, type: !28)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !30, line: 7, baseType: !31)
!30 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !32, line: 49, size: 1728, elements: !33)
!32 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !49, !51, !52, !53, !57, !59, !61, !65, !68, !70, !73, !76, !77, !78, !82, !83}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !31, file: !32, line: 51, baseType: !11, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !31, file: !32, line: 54, baseType: !4, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !31, file: !32, line: 55, baseType: !4, size: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !31, file: !32, line: 56, baseType: !4, size: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !31, file: !32, line: 57, baseType: !4, size: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !31, file: !32, line: 58, baseType: !4, size: 64, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !31, file: !32, line: 59, baseType: !4, size: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !31, file: !32, line: 60, baseType: !4, size: 64, offset: 448)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !31, file: !32, line: 61, baseType: !4, size: 64, offset: 512)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !31, file: !32, line: 64, baseType: !4, size: 64, offset: 576)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !31, file: !32, line: 65, baseType: !4, size: 64, offset: 640)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !31, file: !32, line: 66, baseType: !4, size: 64, offset: 704)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !31, file: !32, line: 68, baseType: !47, size: 64, offset: 768)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !32, line: 36, flags: DIFlagFwdDecl)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !31, file: !32, line: 70, baseType: !50, size: 64, offset: 832)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !31, file: !32, line: 72, baseType: !11, size: 32, offset: 896)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !31, file: !32, line: 73, baseType: !11, size: 32, offset: 928)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !31, file: !32, line: 74, baseType: !54, size: 64, offset: 960)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !55, line: 152, baseType: !56)
!55 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!56 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !31, file: !32, line: 77, baseType: !58, size: 16, offset: 1024)
!58 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !31, file: !32, line: 78, baseType: !60, size: 8, offset: 1040)
!60 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !31, file: !32, line: 79, baseType: !62, size: 8, offset: 1048)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 1)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !31, file: !32, line: 81, baseType: !66, size: 64, offset: 1088)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !32, line: 43, baseType: null)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !31, file: !32, line: 89, baseType: !69, size: 64, offset: 1152)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !55, line: 153, baseType: !56)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !31, file: !32, line: 91, baseType: !71, size: 64, offset: 1216)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !32, line: 37, flags: DIFlagFwdDecl)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !31, file: !32, line: 92, baseType: !74, size: 64, offset: 1280)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !32, line: 38, flags: DIFlagFwdDecl)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !31, file: !32, line: 93, baseType: !50, size: 64, offset: 1344)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !31, file: !32, line: 94, baseType: !3, size: 64, offset: 1408)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !31, file: !32, line: 95, baseType: !79, size: 64, offset: 1472)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !80, line: 46, baseType: !81)
!80 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!81 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !31, file: !32, line: 96, baseType: !11, size: 32, offset: 1536)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !31, file: !32, line: 98, baseType: !84, size: 160, offset: 1568)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 160, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 20)
!87 = !DILocation(line: 2, column: 9, scope: !20)
!88 = !DILocation(line: 2, column: 23, scope: !20)
!89 = !DILocation(line: 3, column: 11, scope: !20)
!90 = !DILocation(line: 3, column: 30, scope: !20)
!91 = !DILocation(line: 3, column: 3, scope: !20)
!92 = !DILocation(line: 4, column: 7, scope: !93)
!93 = distinct !DILexicalBlock(scope: !20, file: !21, line: 4, column: 7)
!94 = !DILocation(line: 4, column: 9, scope: !93)
!95 = !DILocation(line: 4, column: 7, scope: !20)
!96 = !DILocation(line: 5, column: 5, scope: !93)
!97 = !DILocation(line: 7, column: 7, scope: !98)
!98 = distinct !DILexicalBlock(scope: !20, file: !21, line: 7, column: 7)
!99 = !DILocation(line: 7, column: 9, scope: !98)
!100 = !DILocation(line: 7, column: 7, scope: !20)
!101 = !DILocation(line: 8, column: 5, scope: !98)
!102 = !DILocation(line: 10, column: 5, scope: !98)
!103 = !DILocation(line: 11, column: 1, scope: !20)
!104 = distinct !DISubprogram(name: "saveFile", scope: !1, file: !1, line: 7, type: !105, scopeLine: 7, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !3, !4, !4}
!107 = !DILocalVariable(name: "data", arg: 1, scope: !104, file: !1, line: 7, type: !3)
!108 = !DILocation(line: 7, column: 21, scope: !104)
!109 = !DILocalVariable(name: "dataType", arg: 2, scope: !104, file: !1, line: 7, type: !4)
!110 = !DILocation(line: 7, column: 32, scope: !104)
!111 = !DILocalVariable(name: "filename", arg: 3, scope: !104, file: !1, line: 7, type: !4)
!112 = !DILocation(line: 7, column: 49, scope: !104)
!113 = !DILocalVariable(name: "output_file", scope: !104, file: !1, line: 8, type: !28)
!114 = !DILocation(line: 8, column: 11, scope: !104)
!115 = !DILocation(line: 8, column: 31, scope: !104)
!116 = !DILocation(line: 8, column: 25, scope: !104)
!117 = !DILocation(line: 11, column: 10, scope: !118)
!118 = distinct !DILexicalBlock(scope: !104, file: !1, line: 11, column: 9)
!119 = !DILocation(line: 11, column: 9, scope: !104)
!120 = !DILocation(line: 12, column: 9, scope: !121)
!121 = distinct !DILexicalBlock(scope: !118, file: !1, line: 11, column: 23)
!122 = !DILocation(line: 13, column: 9, scope: !121)
!123 = !DILocation(line: 15, column: 16, scope: !124)
!124 = distinct !DILexicalBlock(scope: !104, file: !1, line: 15, column: 9)
!125 = !DILocation(line: 15, column: 9, scope: !124)
!126 = !DILocation(line: 15, column: 34, scope: !124)
!127 = !DILocation(line: 15, column: 9, scope: !104)
!128 = !DILocation(line: 16, column: 17, scope: !129)
!129 = distinct !DILexicalBlock(scope: !124, file: !1, line: 15, column: 43)
!130 = !DILocation(line: 16, column: 45, scope: !129)
!131 = !DILocation(line: 16, column: 9, scope: !129)
!132 = !DILocation(line: 17, column: 5, scope: !129)
!133 = !DILocation(line: 17, column: 24, scope: !134)
!134 = distinct !DILexicalBlock(scope: !124, file: !1, line: 17, column: 16)
!135 = !DILocation(line: 17, column: 17, scope: !134)
!136 = !DILocation(line: 17, column: 43, scope: !134)
!137 = !DILocation(line: 17, column: 52, scope: !134)
!138 = !DILocation(line: 17, column: 64, scope: !134)
!139 = !DILocation(line: 17, column: 57, scope: !134)
!140 = !DILocation(line: 17, column: 84, scope: !134)
!141 = !DILocation(line: 17, column: 16, scope: !124)
!142 = !DILocation(line: 18, column: 17, scope: !143)
!143 = distinct !DILexicalBlock(scope: !134, file: !1, line: 17, column: 94)
!144 = !DILocation(line: 18, column: 48, scope: !143)
!145 = !DILocation(line: 18, column: 39, scope: !143)
!146 = !DILocation(line: 18, column: 38, scope: !143)
!147 = !DILocation(line: 18, column: 9, scope: !143)
!148 = !DILocation(line: 19, column: 5, scope: !143)
!149 = !DILocation(line: 19, column: 22, scope: !150)
