; ModuleID = 'generated_code.bc'
source_filename = "generated_code.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [2 x i8] c"a\00", align 1
@.str.1 = private unnamed_addr constant [27 x i8] c"Error opening output file\0A\00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c"char\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@.str.4 = private unnamed_addr constant [6 x i8] c"float\00", align 1
@.str.5 = private unnamed_addr constant [7 x i8] c"double\00", align 1
@.str.6 = private unnamed_addr constant [4 x i8] c"%f\0A\00", align 1
@.str.7 = private unnamed_addr constant [5 x i8] c"long\00", align 1
@.str.8 = private unnamed_addr constant [6 x i8] c"%lld\0A\00", align 1
@.str.9 = private unnamed_addr constant [4 x i8] c"%d\0A\00", align 1
@.str.10 = private unnamed_addr constant [2 x i8] c"x\00", align 1
@.str.11 = private unnamed_addr constant [4 x i8] c"int\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "generated_code.c", directory: "/home/suyoung02/klee/KLEE_Simple", checksumkind: CSK_MD5, checksum: "4b84132fbb20864796b62a345341c64f")
!2 = !{!3, !4, !6, !8, !10}
!3 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !{i32 7, !"Dwarf Version", i32 5}
!13 = !{i32 2, !"Debug Info Version", i32 3}
!14 = !{i32 1, !"wchar_size", i32 4}
!15 = !{i32 7, !"PIC Level", i32 2}
!16 = !{i32 7, !"PIE Level", i32 2}
!17 = !{i32 7, !"uwtable", i32 1}
!18 = !{i32 7, !"frame-pointer", i32 2}
!19 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!20 = distinct !DISubprogram(name: "get_sign", scope: !21, file: !21, line: 1, type: !22, scopeLine: 1, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!21 = !DIFile(filename: "././sample-code/get_sign.c", directory: "/home/suyoung02/klee/KLEE_Simple", checksumkind: CSK_MD5, checksum: "5451c5d0adcb46322bfc036b841a5b14")
!22 = !DISubroutineType(types: !23)
!23 = !{!11, !11}
!24 = !{}
!25 = !DILocalVariable(name: "x", arg: 1, scope: !20, file: !21, line: 1, type: !11)
!26 = !DILocation(line: 1, column: 18, scope: !20)
!27 = !DILocation(line: 2, column: 7, scope: !28)
!28 = distinct !DILexicalBlock(scope: !20, file: !21, line: 2, column: 7)
!29 = !DILocation(line: 2, column: 9, scope: !28)
!30 = !DILocation(line: 2, column: 7, scope: !20)
!31 = !DILocation(line: 3, column: 5, scope: !28)
!32 = !DILocation(line: 5, column: 7, scope: !33)
!33 = distinct !DILexicalBlock(scope: !20, file: !21, line: 5, column: 7)
!34 = !DILocation(line: 5, column: 9, scope: !33)
!35 = !DILocation(line: 5, column: 7, scope: !20)
!36 = !DILocation(line: 6, column: 5, scope: !33)
!37 = !DILocation(line: 8, column: 5, scope: !33)
!38 = !DILocation(line: 9, column: 1, scope: !20)
!39 = distinct !DISubprogram(name: "saveFile", scope: !1, file: !1, line: 7, type: !40, scopeLine: 7, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !3, !4, !4}
!42 = !DILocalVariable(name: "data", arg: 1, scope: !39, file: !1, line: 7, type: !3)
!43 = !DILocation(line: 7, column: 21, scope: !39)
!44 = !DILocalVariable(name: "dataType", arg: 2, scope: !39, file: !1, line: 7, type: !4)
!45 = !DILocation(line: 7, column: 32, scope: !39)
!46 = !DILocalVariable(name: "filename", arg: 3, scope: !39, file: !1, line: 7, type: !4)
!47 = !DILocation(line: 7, column: 49, scope: !39)
!48 = !DILocalVariable(name: "output_file", scope: !39, file: !1, line: 8, type: !49)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !51, line: 7, baseType: !52)
!51 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !53, line: 49, size: 1728, elements: !54)
!53 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !70, !72, !73, !74, !78, !80, !82, !86, !89, !91, !94, !97, !98, !99, !103, !104}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !52, file: !53, line: 51, baseType: !11, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !52, file: !53, line: 54, baseType: !4, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !52, file: !53, line: 55, baseType: !4, size: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !52, file: !53, line: 56, baseType: !4, size: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !52, file: !53, line: 57, baseType: !4, size: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !52, file: !53, line: 58, baseType: !4, size: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !52, file: !53, line: 59, baseType: !4, size: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !52, file: !53, line: 60, baseType: !4, size: 64, offset: 448)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !52, file: !53, line: 61, baseType: !4, size: 64, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !52, file: !53, line: 64, baseType: !4, size: 64, offset: 576)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !52, file: !53, line: 65, baseType: !4, size: 64, offset: 640)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !52, file: !53, line: 66, baseType: !4, size: 64, offset: 704)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !52, file: !53, line: 68, baseType: !68, size: 64, offset: 768)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !53, line: 36, flags: DIFlagFwdDecl)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !52, file: !53, line: 70, baseType: !71, size: 64, offset: 832)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !52, file: !53, line: 72, baseType: !11, size: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !52, file: !53, line: 73, baseType: !11, size: 32, offset: 928)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !52, file: !53, line: 74, baseType: !75, size: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !76, line: 152, baseType: !77)
!76 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!77 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !52, file: !53, line: 77, baseType: !79, size: 16, offset: 1024)
!79 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !52, file: !53, line: 78, baseType: !81, size: 8, offset: 1040)
!81 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !52, file: !53, line: 79, baseType: !83, size: 8, offset: 1048)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 1)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !52, file: !53, line: 81, baseType: !87, size: 64, offset: 1088)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !53, line: 43, baseType: null)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !52, file: !53, line: 89, baseType: !90, size: 64, offset: 1152)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !76, line: 153, baseType: !77)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !52, file: !53, line: 91, baseType: !92, size: 64, offset: 1216)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !53, line: 37, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !52, file: !53, line: 92, baseType: !95, size: 64, offset: 1280)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !53, line: 38, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !52, file: !53, line: 93, baseType: !71, size: 64, offset: 1344)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !52, file: !53, line: 94, baseType: !3, size: 64, offset: 1408)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !52, file: !53, line: 95, baseType: !100, size: 64, offset: 1472)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !101, line: 46, baseType: !102)
!101 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!102 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !52, file: !53, line: 96, baseType: !11, size: 32, offset: 1536)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !52, file: !53, line: 98, baseType: !105, size: 160, offset: 1568)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 160, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 20)
!108 = !DILocation(line: 8, column: 11, scope: !39)
!109 = !DILocation(line: 8, column: 31, scope: !39)
!110 = !DILocation(line: 8, column: 25, scope: !39)
!111 = !DILocation(line: 11, column: 10, scope: !112)
!112 = distinct !DILexicalBlock(scope: !39, file: !1, line: 11, column: 9)
!113 = !DILocation(line: 11, column: 9, scope: !39)
!114 = !DILocation(line: 12, column: 9, scope: !115)
!115 = distinct !DILexicalBlock(scope: !112, file: !1, line: 11, column: 23)
!116 = !DILocation(line: 13, column: 9, scope: !115)
!117 = !DILocation(line: 15, column: 16, scope: !118)
!118 = distinct !DILexicalBlock(scope: !39, file: !1, line: 15, column: 9)
!119 = !DILocation(line: 15, column: 9, scope: !118)
!120 = !DILocation(line: 15, column: 34, scope: !118)
!121 = !DILocation(line: 15, column: 9, scope: !39)
!122 = !DILocation(line: 16, column: 17, scope: !123)
!123 = distinct !DILexicalBlock(scope: !118, file: !1, line: 15, column: 43)
!124 = !DILocation(line: 16, column: 45, scope: !123)
!125 = !DILocation(line: 16, column: 9, scope: !123)
!126 = !DILocation(line: 17, column: 5, scope: !123)
!127 = !DILocation(line: 17, column: 24, scope: !128)
!128 = distinct !DILexicalBlock(scope: !118, file: !1, line: 17, column: 16)
!129 = !DILocation(line: 17, column: 17, scope: !128)
!130 = !DILocation(line: 17, column: 43, scope: !128)
!131 = !DILocation(line: 17, column: 52, scope: !128)
!132 = !DILocation(line: 17, column: 64, scope: !128)
!133 = !DILocation(line: 17, column: 57, scope: !128)
!134 = !DILocation(line: 17, column: 84, scope: !128)
!135 = !DILocation(line: 17, column: 16, scope: !118)
!136 = !DILocation(line: 18, column: 17, scope: !137)
!137 = distinct !DILexicalBlock(scope: !128, file: !1, line: 17, column: 94)
!138 = !DILocation(line: 18, column: 48, scope: !137)
!139 = !DILocation(line: 18, column: 39, scope: !137)
!140 = !DILocation(line: 18, column: 38, scope: !137)
!141 = !DILocation(line: 18, column: 9, scope: !137)
!142 = !DILocation(line: 19, column: 5, scope: !137)
!143 = !DILocation(line: 19, column: 22, scope: !144)
!144 = distinct !DILexicalBlock(scope: !128, file: !1, line: 19, column: 15)
!145 = !DILocation(line: 19, column: 15, scope: !144)
!146 = !DILocation(line: 19, column: 40, scope: !144)
!147 = !DILocation(line: 19, column: 15, scope: !128)
!148 = !DILocation(line: 20, column: 17, scope: !149)
!149 = distinct !DILexicalBlock(scope: !144, file: !1, line: 19, column: 49)
!150 = !DILocation(line: 20, column: 53, scope: !149)
!151 = !DILocation(line: 20, column: 41, scope: !149)
!152 = !DILocation(line: 20, column: 40, scope: !149)
!153 = !DILocation(line: 20, column: 9, scope: !149)
!154 = !DILocation(line: 21, column: 5, scope: !149)
!155 = !DILocation(line: 22, column: 17, scope: !156)
!156 = distinct !DILexicalBlock(scope: !144, file: !1, line: 21, column: 12)
!157 = !DILocation(line: 22, column: 45, scope: !156)
!158 = !DILocation(line: 22, column: 39, scope: !156)
!159 = !DILocation(line: 22, column: 38, scope: !156)
!160 = !DILocation(line: 22, column: 9, scope: !156)
!161 = !DILocation(line: 26, column: 12, scope: !39)
!162 = !DILocation(line: 26, column: 5, scope: !39)
!163 = !DILocation(line: 27, column: 1, scope: !39)
!164 = distinct !DISubprogram(name: "saveArrayFile", scope: !1, file: !1, line: 29, type: !40, scopeLine: 29, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!165 = !DILocalVariable(name: "data", arg: 1, scope: !164, file: !1, line: 29, type: !3)
!166 = !DILocation(line: 29, column: 26, scope: !164)
!167 = !DILocalVariable(name: "dataType", arg: 2, scope: !164, file: !1, line: 29, type: !4)
!168 = !DILocation(line: 29, column: 37, scope: !164)
